gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */
/** @example examples/ble_peripheral/ble_app_hrs/main.c
 *
 * @brief Heart Rate Service Sample Application main file.
 *
 * This file contains the source code for a sample application using the Heart Rate service
 * (and also Battery and Device Information services). This application uses the
 * @ref srvlib_conn_params module.
 */


#include "lis2dh12.h"
#include "int_flash.h"
#include "nrf_drv_timer.h"
#include "button_led.h"
#include "event_detection.h"

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_bas.h"
#include "ble_hrs.h"
#include "ble_dis.h"
#ifdef BLE_DFU_APP_SUPPORT
#include "ble_dfu.h"
#include "dfu_app_handler.h"
#endif // BLE_DFU_APP_SUPPORT
#include "ble_conn_params.h"
#include "boards.h"
#include "sensorsim.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "pstorage.h"
#include "app_trace.h"
#include "bsp.h"
#include "nrf_delay.h"
#include "bsp_btn_ble.h"
#include "ble_pbs.h"
#include "spi_flash_MXIC.h"
#include "nrf_drv_gpiote.h"

//Same definition as ble_pbs.c
#define TSC_ALLDATA_LENGTH														17
#define BSC_ALLDATA_LENGTH														13
#define ESC_ALLDATA_LENGTH														 3
#define DRHC_ALLDATA_LENGTH														14
#define CDRC_ALLDATA_MIN_LENGTH												 3 // NOT USED
#define CDRC_ALLDATA_MAX_LENGTH												20
#define RDRC_ALLDATA_MIN_LENGTH												 3 // NOT USED
#define RDRC_ALLDATA_MAX_LENGTH												20
#define BDC_ALLDATA_LENGTH                             4
#define BDRC_ALLDATA_LENGTH                            4

#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define CENTRAL_LINK_COUNT               0                                          /**<number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT            1                                          /**<number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                      "BLE_PBS_V0_2"                               /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME                "NordicSemiconductor"                      /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                 300                                        /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       180000                                        /**< The advertising timeout in units of seconds. */

#define APP_TIMER_PRESCALER              0                                          /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE          4                                          /**< Size of timer operation queues. */

#define DATA_HEADER_REPORT_INTERVAL      APP_TIMER_TICKS(TIMER_DURATION, APP_TIMER_PRESCALER) 

#define CAL_INTERVAL_DURATION						 100  																			// Calculation data send interval
#define CAL_DATA_INTERVAL      					 APP_TIMER_TICKS(CAL_INTERVAL_DURATION, APP_TIMER_PRESCALER) /**< Battery level measurement interval (ticks). */
#define MIN_BATTERY_LEVEL                81                                         /**< Minimum simulated battery level. */
#define MAX_BATTERY_LEVEL                100                                        /**< Maximum simulated 7battery level. */
#define BATTERY_LEVEL_INCREMENT          1                                          /**< Increment between each simulated battery level measurement. */

#define ADV_STOP_DURATION								 60000  // Stop advertising Period, should be multiple of ADVERTISING_TIMER_DURATION
#define ADV_DURATION										 18000000 // Advertising timeout, should be multiple of ADVERTISING_TIMER_DURATION
#define ADVERTISING_TIMER_DURATION			 1000
#define ADVERTISING_TIMER_INTERVAL       APP_TIMER_TICKS(ADVERTISING_TIMER_DURATION, APP_TIMER_PRESCALER) /**< Advertising timer  (ticks). */
//#define MIN_HEART_RATE                   140                                        /**< Minimum heart rate as returned by the simulated measurement function. */
//#define MAX_HEART_RATE                   300                                        /**< Maximum heart rate as returned by the simulated measurement function. */
//#define HEART_RATE_INCREMENT             10                                         /**< Value by which the heart rate is incremented/decremented for each call to the simulated measurement function. */

#define SHORT_PUSH_ON_LOCK_INTERVAL      10000
#define BUTTON_LED_TIMER_DURATION			 	 2000  // Not minisecond, need confirm
#define BUTTON_LED_INTERVAL              APP_TIMER_TICKS(BUTTON_LED_TIMER_DURATION, APP_TIMER_PRESCALER)  /**< RR interval interval (ticks). */
//#define MIN_RR_INTERVAL                  100                                        /**< Minimum RR interval as returned by the simulated measurement function. */
//#define MAX_RR_INTERVAL                  500                                        /**< Maximum RR interval as returned by the simulated measurement function. */
//#define RR_INTERVAL_INCREMENT            1                                          /**< Value by which the RR interval is incremented/decremented for each call to the simulated measurement function. */

