gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
void flash_write_simulation(void)
{
	float cal_acc_test[3];	
		cal_acc_test[0] = 50+1600;
		cal_acc_test[1] = 30+1600;
		cal_acc_test[2] = 100+1600;			
		int w_cnt = 600 * 3;
	//	flash_data_set_init();	
		while(w_cnt--) {
				if (w_cnt == 1000) {
					flash_data_set_write(NULL, cal_acc_test, 1);
				} else if (w_cnt == 500) {
					flash_data_set_write(NULL, cal_acc_test, 2);
				}	else {
					flash_data_set_write(NULL, cal_acc_test,0);
				}	
		}
		//nrf_delay_ms(20);
		pktCounter = 125;
//		m_pbs.esc_s.number_of_event = 1;
//		uint8_t esc_sim_data[3] = {0,0,1};
//		ble_pbs_esc_update(&m_pbs, esc_sim_data);
		printf("flash write simulation\r\n");
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void cal_data_timeout_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);
	data_process_trigger = true;
}

static void data_process(void)
{
    if (data_process_trigger)
	{
		data_process_trigger = false;
		uint32_t err_code;
	
//	if (pktCounter == 0)
//	{
//		flash_write_simulation();
//	}
	// Simulator flash read
		uint16_t data_x[4] = {0};
		uint16_t data_y[4] = {0};
		uint16_t data_z[4] = {0};
		//uint8_t len = 0;
		uint8_t p_cal_encoded_buffer[20] = {0};
		
		//uint32_t err_code;
#if FLASH_READ	
		uint32_t r_xy;
		uint32_t r_z;
		uint8_t r_event_ID;
		uint32_t r_UTC;
		uint32_t cal_r_xy;
		uint32_t cal_r_z;
		uint8_t r_sensor_interval;	
		int ret=-1;
		
		uint8_t inPktNum=0; //for 4 packet in one notify
		//printf("cdrc_notify_flag:%i,conn:%04X\r\n",cdrc_notify_flag,m_conn_handle);
		//if (ret > 0 && m_conn_handle != BLE_CONN_HANDLE_INVALID && cdrc_notify_flag== true)  // for test
		if(m_conn_handle != BLE_CONN_HANDLE_INVALID && drhc_notify_flag && cdrc_notify_flag)
		{
			ret = flash_data_set_read(&r_xy, &r_z, &cal_r_xy, &cal_r_z, &r_event_ID, &r_UTC, &r_sensor_interval);
			//nrf_delay_ms(100);
			// UART Print
			if (ret < 0)
			{
				printf("no event;");
			}
			else
			{
					printf("%i,%u,", r_event_ID, r_UTC);
					printf("%i,%f,%f,%f\n\r", ret+1,((float)((cal_r_xy&0xFFFF0000)>>16))/100-16,((float)(cal_r_xy&0x0000FFFF))/100-16, (float)cal_r_z/100-16);
					//totalPktNum = (m_pbs.bsc_s.sampling_frequency)*(m_pbs.drhc_s.recorded_event_duration); // need change

					pktCounter = (ret+1)/4;
					//printf("pktCounter : %i \r\n",pktCounter);
					// Send Data Header, use pktCounterCopy check if pktCounter recount 
					// in case that pktCounter miss the first one packet
					// Send Data Header
					if (((pktCounter > pktCounterCopy) || pktCounter == 125) ) 
					{
						uint32_t tempUTC = UTC_get();
						uint8_t p_tempUTC[4]; 
						uint32_big_encode(tempUTC,p_tempUTC);
						uint8_t sim_drhc_data[14] = {20,12,3,r_event_ID,10,p_tempUTC[0],p_tempUTC[1],p_tempUTC[2],p_tempUTC[3],0,0,0,0,0};
						err_code = ble_pbs_drhc_update(&m_pbs, sim_drhc_data);
						printf("drhc_update:%04X\r\n",err_code);
					}
					pktCounterCopy = pktCounter;
					p_cal_encoded_buffer[0] = pktCounter;
					p_cal_encoded_buffer[1] = 18;
					
					pktCounter--;
					// Flash data assign to uint16_t array
					for (int i=0;i<4;i++)
					{
						data_x[i] = (uint16_t)((cal_r_xy&0xFFFF0000)>>16);
						data_y[i] = (uint16_t)(cal_r_xy&0xFFFF);
						data_z[i] = (uint16_t)(cal_r_z&0xFFFF);
						if (i!= 0)
							ret = flash_data_set_read(&r_xy, &r_z, &cal_r_xy, &cal_r_z, &r_event_ID, &r_UTC, &r_sensor_interval);
					}
						// Check data 
		//			for(int i=0;i<4;i++)
		//			{
				//		printf("%i %04X %04X %04X\r\n",i,data_x[i],data_y[i],data_z[i]);
					//}
				//	printf("\r\n");

					// assign 4 read data value to cdrc data packet
					for (int i=2;i<20;i=i+9)
					{
						p_cal_encoded_buffer[i] = (uint8_t) ((data_z[inPktNum]& 0x0FF0)	>> 4) ;
						p_cal_encoded_buffer[i+1] = ((uint8_t)((data_z[inPktNum]& 0x000F) << 4) & 0xF0) | (((data_y[inPktNum]&0x0F00) >> 8)& 0x0F);
						p_cal_encoded_buffer[i+2] = (uint8_t) (data_y[inPktNum]& 0xFF);
						p_cal_encoded_buffer[i+3] = (uint8_t) ((data_x[inPktNum]& 0x0FF0)	>> 4) ;
						p_cal_encoded_buffer[i+4] = ((uint8_t)((data_x[inPktNum]& 0x000F) << 4) & 0xF0) | (((data_z[inPktNum+1]&0x0F00) >> 8)& 0x0F);
						p_cal_encoded_buffer[i+5] = (uint8_t) (data_z[inPktNum+1]& 0xFF);
						p_cal_encoded_buffer[i+6] = (uint8_t) ((data_y[inPktNum+1]& 0x0FF0)	>> 4) ;
						p_cal_encoded_buffer[i+7] = ((uint8_t)((data_y[inPktNum+1]& 0x000F) << 4) & 0xF0) | (((data_x[inPktNum+1]&0x0F00) >> 8)& 0x0F);
						p_cal_encoded_buffer[i+8] = (uint8_t) (data_x[inPktNum+1]& 0xFF);
						inPktNum += 2;
					}
		//			printf("ret: %i,Cal data:",ret);
		//			for(int i=0;i<20;i++)
		//			{
		//				printf("%02X",p_cal_encoded_buffer[i]);
		//			}
		//			printf("\r\n");
		//			// Check Flash data read error
		//			if (p_cal_encoded_buffer[19]==0xFF &&p_cal_encoded_buffer[18]==0xFF&&p_cal_encoded_buffer[17]==0xFF && p_cal_encoded_buffer[16]==0xFF)
		//			{
		//					for(int i=19;i>=2;i--)
		//					{
		//						p_cal_encoded_buffer[i] = p_cal_encoded_buffer_prepare[i];
		//					}
		//			}
					err_code = ble_pbs_cdrc_update(&m_pbs, p_cal_encoded_buffer);
					printf("cdrc_update_err:%04X\r\n",err_code);
					
					//Prepare for flash read error
		//			for(int i=19;i>=2;i--)
		//			{
		//				p_cal_encoded_buffer_prepare[i] = p_cal_encoded_buffer[i];
		//			}
		}
		}
#endif
	} // if(ble_routine_trigger)
}



/**@brief Function for handling the Heart rate measurement timer timeout.
 *
 * @details This function will be called each time the heart rate measurement timer expires.
 *          It will exclude RR Interval data from every third measurement.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void advertising_duration_handle(void)
{
	if (advertising_trigger)
	{
		advertising_trigger = false;
		uint32_t err_code;
		adv_counter--;
		if (adv_counter==0 && adv_on == true)
		{
			sd_ble_gap_adv_stop();
			printf("adv_stop;adv_counter:%i\r\n",adv_counter);
			adv_counter = ADV_STOP_DURATION/ADVERTISING_TIMER_DURATION;
			adv_on = false;
		}
		else if (adv_counter == 0 && adv_on == false)
		{
			err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
			printf("adv_start;adv_err:%04X\r\n",err_code);
			adv_counter = ADV_DURATION/ADVERTISING_TIMER_DURATION;
			adv_on = true;
		}
  }
}
static void adv_timeout_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);
	// For advertising
	//advertising_trigger = true;
}
static int test = 0;
extern void bdrc_data_encode(uint8_t*,const bdrc_t * );

static void button_led_process(void)
{
	if (button_led_trigger)
	{
		// Check Button Push Status
		button_led_trigger = false;
		uint8_t button_status = button_status_get();
		//printf("button_status:%02X\r\n",button_status);
		uint8_t encoded_bdrc_data [BDRC_ALLDATA_LENGTH] = {0};
		if (button_status != 0)
		{
			m_pbs.bdrc_s.button_status = button_status;
			bdrc_data_encode(encoded_bdrc_data, &m_pbs.bdrc_s);
			ble_pbs_bdrc_update(&m_pbs,encoded_bdrc_data);
			//nrf_delay_ms(100);
			m_pbs.bdrc_s.button_status = 0;
			bdrc_data_encode(encoded_bdrc_data, &m_pbs.bdrc_s);
			ble_pbs_bdrc_update(&m_pbs,encoded_bdrc_data);
		}
//		if (r_led_pattern_push_cnt >0 )
//		{
//			if (red_led_lock == 0)
//			{
//			//Into Short Push State, red_led_lock start to count until 0
//			red_led_lock = SHORT_PUSH_ON_LOCK_INTERVAL/BUTTON_LED_TIMER_DURATION;
//			m_pbs.bdrc_s.button_status = 0x01;
//			printf("adv_time:%02X,adv_interval:%04X\r\n",m_pbs.bdrc_s.advertising_time,m_pbs.bdrc_s.bdrc_advertising_interval);
//			bdrc_data_encode(encoded_bdrc_data, &m_pbs.bdrc_s);
//			ble_pbs_bdrc_update(&m_pbs,encoded_bdrc_data);
//			}
//		}
//		else if (r_led_pattern_push_cnt >0 & red_led_lock == 0)
//		{
//			m_pbs.bdrc_s.button_status = 0;
//			bdrc_data_encode(encoded_bdrc_data, &m_pbs.bdrc_s);			
//			ble_pbs_bdrc_update(&m_pbs,encoded_bdrc_data);	
//		}
//		else if (red_led_lock < 0)
//			red_led_lock = 0;
//		//printf("r_led_pattern_push_cnt:%i,red_led_lock:%i\r\n,",r_led_pattern_push_cnt,red_led_lock);
	}
}

static void button_led_timeout_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);
	button_led_trigger = true;
}


/**@brief Function for handling the RR interval timer timeout.
 *
 * @details This function will be called each time the RR interval timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
//static void rr_interval_timeout_handler(void * p_context)
//{
//    UNUSED_PARAMETER(p_context);

//    if (m_rr_interval_enabled)
//    {
//        uint16_t rr_interval;

//        rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
//                                                      &m_rr_interval_sim_cfg);
//        ble_hrs_rr_interval_add(&m_hrs, rr_interval);
//    }
//}


/**@brief Function for handling the Sensor Contact Detected timer timeout.
 *
 * @details This function will be called each time the Sensor Contact Detected timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
//static void sensor_contact_detected_timeout_handler(void * p_context)
//{
//    static bool sensor_contact_detected = false;

//    UNUSED_PARAMETER(p_context);

//    sensor_contact_detected = !sensor_contact_detected;
//    ble_hrs_sensor_contact_detected_update(&m_hrs, sensor_contact_detected);
//}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

